---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.MacroFailures
source: html/78a523d0-40b6-5f23-594b-3ae152fcc252.htm
---
# BuiltInFailures.MacroFailures Properties

Macro project with name [MacroModuleName] duplicates with central file. Delete the macro project or re-create it with another name to proceed.